{
    "ages": {
        "0": {
            "original": {
                "name": "Classic Age",
                "name2": "of Innovation",
                "type": "Standard",
                "selectionMethodID": 0,
                "variants": [
                    {
                        "Name": "Technology",
                        "Link": "/Variants/Techs"
                    }
                ],
                "scoring": {
                    "FC": 4,
                    "HC": 2,
                    "T": 1
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "1": {
            "original": {
                "name": "Obedient Age",
                "name2": "of Incursion",
                "type": "Standard",
                "selectionMethodID": 1,
                "variants": [
                    {
                        "Name": "Rewards Deck",
                        "Link": "/Variants/RewardsDeck"
                    },
                    {
                        "Name": "Ultra Rewards",
                        "Link": "/Variants/RewardsDeck",
                        "Subvariant": true
                    }
                ],
                "scoring": {
                    "FC": 3,
                    "HC": 1,
                    "W": 2
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "2": {
            "original": {
                "name": "Doomed Age",
                "name2": "of Conflict",
                "type": "Standard",
                "selectionMethodID": 2,
                "variants": [
                    {
                        "Name": "Hazard Deck",
                        "Link": "/Variants/Hazards"
                    }
                ],
                "scoring": {
                    "FC": 4,
                    "HC": 3
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "3": {
            "original": {
                "name": "Dignified Age",
                "name2": "of Alliances",
                "type": "Standard",
                "selectionMethodID": 3,
                "variants": [
                    {
                        "Name": "Team Cosmic",
                        "Link": "/Variants/TeamMode"
                    }
                ],
                "scoring": {
                    "FC": 2,
                    "HC": 1
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "4": {
            "original": {
                "name": "Tenuous Age",
                "name2": "of Storms",
                "type": "Standard",
                "selectionMethodID": 4,
                "variants": [
                    {
                        "Name": "Space Stations",
                        "Link": "/Variants/Stations"
                    }
                ],
                "scoring": {
                    "FC": 2,
                    "HC": 1,
                    "SS": 1
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "5": {
            "original": {
                "name": "Mundane Age",
                "name2": "of Dominion",
                "type": "Standard",
                "selectionMethodID": 5,
                "variants": [
                    {
                        "Name": "Reward Deck",
                        "Link": "/Variants/RewardsDeck"
                    },
                    {
                        "Name": "Hazard Deck",
                        "Link": "/Variants/Hazards"
                    }
                ],
                "scoring": {
                    "FC": 3,
                    "HC": 2
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "6": {
            "designNotes": "Strangely, despite referecing Cosmic Eons, this age does utilise the hidden alliance variant nor foreign aid.",
            "original": {
                "name": "Forgotten Age",
                "name2": "of Eons",
                "type": "Standard",
                "selectionMethodID": 6,
                "variants": [
                    {
                        "Name": "Array Objectives",
                        "Link": "/Variants/Objectives"
                    }
                ],
                "scoring": {
                    "FC": 1,
                    "V": 6
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "7": {
            "original": {
                "name": "Cynical Age",
                "name2": "of Frontiers",
                "type": "Standard",
                "selectionMethodID": 7,
                "variants": [
                    {
                        "Name": "Moons",
                        "Link": "/Variants/Moons"
                    }
                ],
                "scoring": {
                    "FC": 1,
                    "HC": 1,
                    "M": 1
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "8": {
            "original": {
                "name": "Vibrant Age",
                "name2": "of Luminance",
                "type": "Standard",
                "selectionMethodID": 8,
                "variants": [
                    {
                        "Name": "Lux",
                        "Link": "/Variants/Lux"
                    }
                ],
                "scoring": {
                    "FC": 3,
                    "HC": 1,
                    "ML": 6
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "9": {
            "original": {
                "name": "Polarized Age",
                "name2": "of Mutations",
                "type": "Standard",
                "selectionMethodID": 9,
                "variants": [
                    {
                        "Name": "Evolution",
                        "Link": "/Variants/Evolutions"
                    }
                ],
                "scoring": {
                    "FC": 3,
                    "HC": 1
                },
                "expansion": "Cosmic Odyssey"
            }
        },
        "10": {
            "original": {
                "name": "MEGA",
                "name2": "",
                "type": "Modifier",
                "selectionMethodID": null,
                "variants": [
                    {
                        "Name": "Double Aliens",
                        "Link": ""
                    }
                ],
                "scoring": {},
                "expansion": "Cosmic Odyssey"
            }
        }
    },
    "scoring": {
        "FC": {
            "name": "per foreign colony",
            "rules": "Players score this many points for each of their foreign colonies at the end of the game.",
            "icon": ""
        },
        "HC": {
            "name": "per home colony",
            "rules": "Players score this many points for each of their home colonies at the end of the game.",
            "icon": ""
        },
        "W": {
            "name": "per ship in the warp",
            "rules": "Players score this many points for each of their ships in the warp at the end of the game. (This does not include ships that are captured or removed from the game.)",
            "icon": ""
        },
        "T": {
            "name": "per tech",
            "rules": "Players score this many points for each of their techs the end of the game, regardless of research state.",
            "icon": ""
        },
        "SS": {
            "name": "per space stations",
            "rules": "Players score this many points for each space stations, sky city and deep space station they control at the end of the game.",
            "icon": ""
        },
        "V": {
            "name": "for winning",
            "rules": "The player(s) who reached the normal victory condition will not automatically be ranked #1 this game, but will instead score this many points.",
            "icon": ""
        },
        "M": {
            "name": "per moon",
            "rules": "Players score this many points for each moon they occupy at the end of the game.",
            "icon": ""
        },
        "ML": {
            "name": "for the most lux",
            "rules": "The player(s) who have the most lux at the end of the game will score this many points.",
            "icon": ""
        }
    },
    "selectionMethods": {
        "0": {
            "original": {
                "name": "Deal 2, Choose 1",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, deal each player two alien sheets facedown. Each player looks at their alien sheets, chooses one, and discards the other. After each player has chosen an alien, they reveal their alien."
            }
        },
        "1": {
            "original": {
                "name": "Endowment",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, deal each player two alien sheets. Each player gives one facedown to the player on their right and discards the other. After each player has made their decision, all players reveal the alien they were given."
            }
        },
        "2": {
            "original": {
                "name": "Draw Straws",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, the player to the right of the first player draws a number of alien sheets equal to the number of players. That player chooses one, reveals it, and passes the remaining aliens clockwise to the next player. This process repeats until all players have chosen an alien, with the last player not having a choice."
            }
        },
        "3": {
            "original": {
                "name": "Delegation",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, the first player draws one alien sheet, looks at it, and assigns it to another player. Then, that player draws one alien sheet, looks at it, and assigns it to a player that has not been assigned an alien sheet yet. The process repeats until all but one player has been assigned an alien. That player draws two alien sheets, chooses one to keep, and discards the other."
            }
        },
        "4": {
            "original": {
                "name": "Tidy Bowl",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, deal each player two alien sheets. Each player chooses one to discard and places the other facedown in a pile. The pile is shuffled and one alien from the pile is dealt to each player. Then, each player reveals their dealt alien."
            }
        },
        "5": {
            "original": {
                "name": "Draft",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, the player to the right of the first player draws a number of alien sheets equal to one more than the number of players. That player chooses one alien, reveals it, and passes the remaining aliens clockwise to next player. This process repeats until all players have chosen an alien. The remaining alien is discarded."
            }
        },
        "6": {
            "original": {
                "name": "Unseen",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, the player to the right of the first player is the 'decider'. The decider takes an alien from the top of the alien stack and holds it up so they cannot see it, but all other players can. Clockwise from the decider, each player announces whether or not they want that alien. After each player has made their choice known, the decider either gives the alien to any player who announced that they wanted it or the decider chooses to keep it. If they keep it, the next player clockwise from the decider without an alien becomes the decider and repeats this process. If no one wants the alien, it is discarded, and the decider takes another alien from the top of the stack. When there is only one player without an alien, they draw and keep the alien from the top of the alien stack."
            }
        },
        "7": {
            "original": {
                "name": "Eliminator",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, reveal two aliens per player and place them in the middle of the play area. The first player chooses an alien to discard. The next player in clockwise order repeats this process until each player has discarded one alien. Then, the first player chooses one alien to take. The next player in clockwise order repeats this process until all players have an alien, with the last player not having a choice."
            }
        },
        "8": {
            "original": {
                "name": "Spectrum",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, separate the aliens into three decks by alert level (green, yellow, and red). Deal each player one card from each deck. Each player chooses one alien sheet and discards the other two. After each player has chosen an alien, they reveal their chosen alien."
            }
        },
        "9": {
            "original": {
                "name": "Options",
                "expansion": "Cosmic Odyssey",
                "body": "When selecting aliens for this age, deal each player two alien sheets. Each player gives one facedown to the player to their left and gives the other facedown to the player to their right. Then, each player picks up both aliens that they were given, chooses one alien sheet, and discards the other. After each player has chosen an alien, they reveal their chosen alien."
            }
        }
    }
}